# Pandas

In [1]:
# Importing numpy and pandas library
import numpy as np
import pandas as pd

### Pandas Series

One dimensional labeled array in Pandas series is capable of holding any type of data. Data alignment in Pandas is intrinsic. Why is pandas similar to NumPy on this regard?

In [2]:
# Understanding what goes into a pandas series (notice the index input option for a series)
pd.Series?

In [4]:
# Creating a pandas series from a list (similar to numpy.array)
my_list = [1,2,3]
print(my_list)
ds = pd.Series(my_list) # short for data-series (ds)
type(ds) # printing the type of pandas data series

[1, 2, 3]

pandas.core.series.Series

In [5]:
# Printing the output (notice how the output is different than that of the numpy array)
print(pd.Series(my_list))
print("--"*10)
np.array(my_list)

0    1
1    2
2    3
dtype: int64
--------------------

array([1, 2, 3])

In [6]:
# Again, the syntax for creating a pandas series is pd.Series(data,index)

# Creating a pandas series from numpy array
my_array = np.linspace(0,10,11)
ds = pd.Series(my_array)
print(my_array)
print(80*'-')
ds # Pandas series prints the index and values (unlike numpy array)

[ 0.  1.  2.  3.  4.  5.  6.  7.  8.  9. 10.]
--------------------------------------------------------------------------------

0      0.0
1      1.0
2      2.0
3      3.0
4      4.0
5      5.0
6      6.0
7      7.0
8      8.0
9      9.0
10    10.0
dtype: float64

In [11]:
# Playing around with the index
my_array  = np.linspace(0,10,11)
my_index1 = np.linspace(10,20,11)
my_index2 = np.linspace(100,110,11)
ds1 = pd.Series(data=my_array,index=my_index1)
ds2 = pd.Series(data=my_array,index=my_index1) # Two series with same vlaues but different index

In [12]:
ds1

10.0     0.0
11.0     1.0
12.0     2.0
13.0     3.0
14.0     4.0
15.0     5.0
16.0     6.0
17.0     7.0
18.0     8.0
19.0     9.0
20.0    10.0
dtype: float64

In [13]:
ds2

10.0     0.0
11.0     1.0
12.0     2.0
13.0     3.0
14.0     4.0
15.0     5.0
16.0     6.0
17.0     7.0
18.0     8.0
19.0     9.0
20.0    10.0
dtype: float64

In [16]:
# You can not compare the two dataframes (due to different indexes they are two different dataframes)
# For two pandas series to be comparable, they must be identical in all respects (index and values)
(ds1 == ds2)

10.0    True
11.0    True
12.0    True
13.0    True
14.0    True
15.0    True
16.0    True
17.0    True
18.0    True
19.0    True
20.0    True
dtype: bool

In [17]:
# Index can take any name (not only restricted to numbers)
my_array3 = np.array([1,2,3,4])
my_index3 = ["A B C D".split()]
ds3 = pd.Series(data=my_array3,index=my_index3)
ds3

A    1
B    2
C    3
D    4
dtype: int32

In [37]:
# Can we have the same index across two rows?
my_array3 = np.array([1,2,3,4])
my_index3 = ["A B B C".split()]
ds3 = pd.Series(data=my_array3,index=my_index3)
ds3

A    1
B    2
B    3
C    4
dtype: int32

In [44]:
# What happens when we select index "B"
id(ds3.loc["B"]),id(ds3)

(2794088006768, 2794087958120)

In [20]:
# Creating two pandas series with different indices 
my_array3 = np.array([1,2,3,4])
my_index3 = ["A B C D".split()]
ds3 = pd.Series(data=my_array3,index=my_index3)

my_array4 = np.array([1,2,3,4])
my_index4 = ["B C D E".split()]
ds4 = pd.Series(data=my_array4,index=my_index4)

In [46]:
pd.Series?

In [22]:
ds4

B    1
C    2
D    3
E    4
dtype: int32

In [23]:
# When we try to add two series with different index values
ds3+ds4

A    NaN
B    3.0
C    5.0
D    7.0
E    NaN
dtype: float64

In [25]:
# What is NaN (arithmetic operations on nan)
np.nan
type(np.nan)

float

In [32]:
#Resetting index (a new object from a new class)
print(type(ds))
print(ds3)
ds3.reset_index(drop=True)
type(ds.reset_index())

<class 'pandas.core.series.Series'>
A    1
B    2
C    3
D    4
dtype: int32

0    1
1    2
2    3
3    4
dtype: int32

### Pandas Data Frames

Recall that a numpy matrix was created by stacking numpy arrays. Similarly, a Pandas dataframe is constructed by stacking pandas series together.

In [47]:
# Visualizing our data through a numpy matrix first (numpy matrix is a stack of numpy ndarrays)
my_matrix = np.array([['Ronaldo', 2002, 'Brazil'],
                      ['Grosso', 2006, 'Italy'],
                      ['Iniesta', 2010, 'Spain'],
                      ['Gotze', 2014, 'Germany']])

my_matrix

array([['Ronaldo', '2002', 'Brazil'],
       ['Grosso', '2006', 'Italy'],
       ['Iniesta', '2010', 'Spain'],
       ['Gotze', '2014', 'Germany']], dtype='<U7')

In [51]:
# Creating a pandas dataframe from scratch 
df = pd.DataFrame([['Andy', 87, 'M'],
                   ['Bill', 67, 'M'],
                   ['Catherine', 93, 'F'],
                   ['David', 95, 'M'],
                   ['Emma', 50, 'F']],
                  columns=['Name', 'Score', 'Gender'])

df

        Name  Score Gender
0       Andy     87      M
1       Bill     67      M
2  Catherine     93      F
3      David     95      M
4       Emma     50      F

In [49]:
type(df)

pandas.core.frame.DataFrame

In [62]:
# Selecting a column
df[['Score','Name']]

   Score       Name
0     87       Andy
1     67       Bill
2     93  Catherine
3     95      David
4     50       Emma

In [53]:
# SQL way of selecting data (not the recommended way - not considered good a programming practice)
df.Score

0    87
1    67
2    93
3    95
4    50
Name: Score, dtype: int64

In [63]:
# Selecting two columns (spot the difference)
df

        Name  Score Gender
0       Andy     87      M
1       Bill     67      M
2  Catherine     93      F
3      David     95      M
4       Emma     50      F

In [65]:
# Rearranging the column order
df = df[['Name','Gender','Score']] # not an inplace operation
df

        Name Gender  Score
0       Andy      M     87
1       Bill      M     67
2  Catherine      F     93
3      David      M     95
4       Emma      F     50

In [66]:
# Location operator - syntax is .loc[row,column]
df.loc[0,["Name","Score"]]

Name     Andy
Score      87
Name: 0, dtype: object

In [67]:
# Modifying data using the Location operator
df.loc[0,"Score"] = 92
df

        Name Gender  Score
0       Andy      M     92
1       Bill      M     67
2  Catherine      F     93
3      David      M     95
4       Emma      F     50

In [70]:
df

        Name Gender  Score
A       Andy      M     92
B       Bill      M     67
C  Catherine      F     93
D      David      M     95
E       Emma      F     50

In [71]:
# Modifying the index and using the loc operator
df.index = "A B C D E".split()
df
df.loc["A",:]
# error if we change A to 0

Name      Andy
Gender       M
Score       92
Name: A, dtype: object

In [78]:
df['Score']

A    92
B    67
C    93
D    95
E    50
Name: Score, dtype: int64

In [82]:
df1 = pd.DataFrame([['A',1],['B',2]])
ds1 = pd.Series(np.array([1,2]))
ds1

0    1
1    2
dtype: int32

In [75]:
# Showing column with iloc
df.iloc[:,1] # Rows and columns in iloc have to be integers (names will give an error)

A    M
B    M
C    F
D    M
E    F
Name: Gender, dtype: object

In [77]:
# When a series is compared to a constant (similar to numpy)
df[df['Score']>90]

        Name Gender  Score
A       Andy      M     92
C  Catherine      F     93
D      David      M     95

### DataFrame Operations

In [94]:
# Creating a new column
df = pd.DataFrame([['stock1',50,1000],
                   ['stock2',75,900],
                   ['stock3',125,400]],columns=['stock_name','price','shares'])
df
df['market_cap'] = df['price']*df['shares']
df

  stock_name  price  shares  market_cap
0     stock1     50    1000       50000
1     stock2     75     900       67500
2     stock3    125     400       50000

In [89]:
# Sum function can be called on the series (and on the dataframe)
df['market_cap'].sum()

167500

In [90]:
# Create an empty dataframe column by broadcasting
df['pe_ratio'] = 0
df

  stock_name  price  shares  market_cap  pe_ratio
0     stock1     50    1000       50000         0
1     stock2     75     900       67500         0
2     stock3    125     400       50000         0

In [92]:
# Dropping the market_cap column
df.drop(columns=['market_cap'],inplace=True) # inplace=False is default
df

  stock_name  price  shares  pe_ratio
0     stock1     50    1000         0
1     stock2     75     900         0
2     stock3    125     400         0

In [93]:
# Dropping rows
df.drop(0,inplace=True) # not an inplace opearator
df

  stock_name  price  shares  pe_ratio
1     stock2     75     900         0
2     stock3    125     400         0

In [99]:
# Sorting the dataframe on outstanding shares
df.sort_values(by=['shares']).reset_index(drop=True)

  stock_name  price  shares  market_cap
0     stock3    125     400       50000
1     stock2     75     900       67500
2     stock1     50    1000       50000

In [100]:
# Setting index
df = df.set_index('stock_name')
df

            price  shares  market_cap
stock_name
stock1         50    1000       50000
stock2         75     900       67500
stock3        125     400       50000

In [101]:
# Resetting index
df = df.reset_index()
df

  stock_name  price  shares  market_cap
0     stock1     50    1000       50000
1     stock2     75     900       67500
2     stock3    125     400       50000

In [102]:
# Creating a dataframe 
df = pd.DataFrame(np.linspace(0,8,9).reshape(3,3),columns=['A B C'.split()])
df

     A    B    C
0  0.0  1.0  2.0
1  3.0  4.0  5.0
2  6.0  7.0  8.0

In [104]:
# Sum function 
df.sum(axis=1)

0     3.0
1    12.0
2    21.0
dtype: float64

### Data Analysis

In [180]:
# Loading panel data through pandas
df = pd.read_csv("stock_data.csv")
df.shape

(2960, 6)

In [181]:
# Viewing a sample of the dataframe (due to large size)
df.tail(10)

,permno,company_name,date,total_returns,price,share_outstanding
2950,10137,ALLEGHENY ENERGY INC,5/31/2010 0:00,-0.060606,20.46,169579
2951,10137,ALLEGHENY ENERGY INC,6/30/2010 0:00,0.018084,20.68,169579
2952,10137,ALLEGHENY ENERGY INC,7/31/2010 0:00,0.102514,22.8,169579
2953,10137,ALLEGHENY ENERGY INC,8/31/2010 0:00,-0.010965,22.55,169615
2954,10137,ALLEGHENY ENERGY INC,9/30/2010 0:00,0.094013,24.52,169615
2955,10137,ALLEGHENY ENERGY INC,10/31/2010 0:00,-0.053834,23.2,169615
2956,10137,ALLEGHENY ENERGY INC,11/30/2010 0:00,NaN,22.82,169939
2957,10137,ALLEGHENY ENERGY INC,12/31/2010 0:00,C,C,169939
2958,10137,ALLEGHENY ENERGY INC,1/31/2011 0:00,0.063531,25.78,169939
2959,10137,ALLEGHENY ENERGY INC,2/28/2011 0:00,-0.009073,NaN,169974

In [113]:
# Getting info on our dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2960 entries, 0 to 2959
Data columns (total 6 columns):
permno               2960 non-null int64
company_name         2960 non-null object
date                 2960 non-null object
total_returns        2933 non-null object
price                2920 non-null object
share_outstanding    2960 non-null int64
dtypes: int64(2), object(4)
memory usage: 138.8+ KB

In [114]:
# Unique permnos
df['permno'].nunique()

25

In [115]:
# Unique company names
df['company_name'].nunique()

35

In [123]:
# Observe how the date is initially loaded 
df['date'][0]
#df['date'][0]

'12/31/2009 0:00'

In [130]:
# Pandas has a convenient hack for dates
df['date'] = pd.to_datetime(df['date'])
df['date'][0]

Timestamp('2009-12-31 00:00:00')

In [128]:
# Dataframe date format
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2960 entries, 0 to 2959
Data columns (total 6 columns):
permno               2960 non-null int64
company_name         2960 non-null object
date                 2960 non-null datetime64[ns]
total_returns        2933 non-null object
price                2920 non-null object
share_outstanding    2960 non-null int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 138.8+ KB

In [ ]:
# Converting datetime from one format to another
df['date'].dt.strftime("%d-%m-%Y").tail()

In [129]:
# writing dates in pandas
pd.Timestamp(year=2013,month=12,day=7)

Timestamp('2013-12-07 00:00:00')

In [134]:
# Adding days to a date (or hours/minutes etc)
some_date = pd.Timestamp(year=2013,month=12,day=7)
print(some_date)
some_date + pd.Timedelta('3 days')
#type(pd.Timedelta("1 day"))

2013-12-07 00:00:00

Timestamp('2013-12-10 00:00:00')

In [135]:
# Creating a Series of dates (a cool trick!)
my_date = pd.to_datetime(pd.Series(['13 July 2013','5 May 2010','15 March 2020']))
print(my_date)
my_date + pd.tseries.offsets.MonthEnd(0)

0   2013-07-13
1   2010-05-05
2   2020-03-15
dtype: datetime64[ns]

0   2013-07-31
1   2010-05-31
2   2020-03-31
dtype: datetime64[ns]

In [139]:
# Using Pandas date range to generate dates
pd.date_range(start='01 Jan 2021', end='31 Jan 2021')
pd.date_range(start='01 Jan 2021', periods=18, freq= 'W')

DatetimeIndex(['2021-01-03', '2021-01-10', '2021-01-17', '2021-01-24',
               '2021-01-31', '2021-02-07', '2021-02-14', '2021-02-21',
               '2021-02-28', '2021-03-07', '2021-03-14', '2021-03-21',
               '2021-03-28', '2021-04-04', '2021-04-11', '2021-04-18',
               '2021-04-25', '2021-05-02'],
              dtype='datetime64[ns]', freq='W-SUN')

In [144]:
# Loading the dataframe again
df.tail()

,permno,company_name,date,total_returns,price,share_outstanding
2955,10137,ALLEGHENY ENERGY INC,2010-10-31,-0.053834,23.2,169615
2956,10137,ALLEGHENY ENERGY INC,2010-11-30,NaN,22.82,169939
2957,10137,ALLEGHENY ENERGY INC,2010-12-31,C,C,169939
2958,10137,ALLEGHENY ENERGY INC,2011-01-31,0.063531,25.78,169939
2959,10137,ALLEGHENY ENERGY INC,2011-02-28,-0.009073,NaN,169974

In [143]:
# Checking the dataframe types (from info)
df.info() # observe that prices and returns are still objects!

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2960 entries, 0 to 2959
Data columns (total 6 columns):
permno               2960 non-null int64
company_name         2960 non-null object
date                 2960 non-null datetime64[ns]
total_returns        2933 non-null object
price                2920 non-null object
share_outstanding    2960 non-null int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 138.8+ KB

In [158]:
# Converting price and returns to numbers
df['price'] = pd.to_numeric(df['price'],errors='coerce')
df['total_returns'] = pd.to_numeric(df['total_returns'],errors='coerce')

In [146]:
# Checking info again
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2960 entries, 0 to 2959
Data columns (total 6 columns):
permno               2960 non-null int64
company_name         2960 non-null object
date                 2960 non-null datetime64[ns]
total_returns        2929 non-null float64
price                2916 non-null float64
share_outstanding    2960 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(2), object(1)
memory usage: 138.8+ KB

In [147]:
df.tail()

,permno,company_name,date,total_returns,price,share_outstanding
2955,10137,ALLEGHENY ENERGY INC,2010-10-31,-0.053834,23.20,169615
2956,10137,ALLEGHENY ENERGY INC,2010-11-30,NaN,22.82,169939
2957,10137,ALLEGHENY ENERGY INC,2010-12-31,NaN,NaN,169939
2958,10137,ALLEGHENY ENERGY INC,2011-01-31,0.063531,25.78,169939
2959,10137,ALLEGHENY ENERGY INC,2011-02-28,-0.009073,NaN,169974

In [ ]:
# Rows that have NaNs
df.isnull() # Returns True in dataframe where values are NaN
#df.isnull().sum() gives count of NaN values
#df[df['total_returns'].isnull()] # notice I can pass a true/false array to see which rows have returns as missing

In [152]:
# Dropping NaN values (involves dropping the whole row) - we drop the NaNs by writing command dropna()
df.dropna(subset=['price']).tail()

,permno,company_name,date,total_returns,price,share_outstanding
2953,10137,ALLEGHENY ENERGY INC,2010-08-31,-0.010965,22.55,169615
2954,10137,ALLEGHENY ENERGY INC,2010-09-30,0.094013,24.52,169615
2955,10137,ALLEGHENY ENERGY INC,2010-10-31,-0.053834,23.20,169615
2956,10137,ALLEGHENY ENERGY INC,2010-11-30,NaN,22.82,169939
2958,10137,ALLEGHENY ENERGY INC,2011-01-31,0.063531,25.78,169939

In [159]:
# Method 1 for dealing with all NaN values
df.replace(np.nan,0).tail()
df.tail()

,permno,company_name,date,total_returns,price,share_outstanding
2955,10137,ALLEGHENY ENERGY INC,10/31/2010 0:00,-0.053834,23.20,169615
2956,10137,ALLEGHENY ENERGY INC,11/30/2010 0:00,NaN,22.82,169939
2957,10137,ALLEGHENY ENERGY INC,12/31/2010 0:00,NaN,NaN,169939
2958,10137,ALLEGHENY ENERGY INC,1/31/2011 0:00,0.063531,25.78,169939
2959,10137,ALLEGHENY ENERGY INC,2/28/2011 0:00,-0.009073,NaN,169974

In [160]:
# Method 2 for dealing with all NaN values
df['total_returns'] = df['total_returns'].fillna(0)
df['price'] = df['price'].fillna(method='ffill') # ffill is forward fill for handling NaN values
df.tail()

,permno,company_name,date,total_returns,price,share_outstanding
2955,10137,ALLEGHENY ENERGY INC,10/31/2010 0:00,-0.053834,23.20,169615
2956,10137,ALLEGHENY ENERGY INC,11/30/2010 0:00,0.000000,22.82,169939
2957,10137,ALLEGHENY ENERGY INC,12/31/2010 0:00,0.000000,22.82,169939
2958,10137,ALLEGHENY ENERGY INC,1/31/2011 0:00,0.063531,25.78,169939
2959,10137,ALLEGHENY ENERGY INC,2/28/2011 0:00,-0.009073,25.78,169974

In [ ]:
# Filtering
df = df[df['permno']==10001] # df and index start without 10001 permno
df

In [ ]:
# Exporting your dataframe to a csv
df.to_csv('out.csv')

### Merging

In [224]:
# Creating a dataframe with stock names and stock price
df1 = pd.DataFrame([['A',100],
                    ['B',120],
                    ['C',50]],columns=['stock','price'])
df1

  stock  price
0     A    100
1     B    120
2     C     50

In [225]:
# Creating a dataframe with stock name and stock PE ratio
df2 = pd.DataFrame([['B',10],
                    ['C',14],
                    ['D',1000]],columns=['stock','pe_ratio'])
df2

  stock  pe_ratio
0     B        10
1     C        14
2     D      1000

In [227]:
# Simple merging syntax
df1.merge(df2,on=['stock'],how='right')
# inner - intersection
# outer - union
# left - keeps all left dataframe 
# right - keeps all right dataframe

  stock  price  pe_ratio
0     B  120.0        10
1     C   50.0        14
2     D    NaN      1000

### Groupby

Similar to the Pivot table in excel, this function lets you group/split data for calculations and transformations.

In [169]:
# Reloading the dataset analyzed above (shortcut to parse the dates while reading the data)
df = pd.read_csv("stock_data.csv",sep = ',',parse_dates=['date'])

# Converting any letters into NaN
df['price'] = pd.to_numeric(df['price'],errors='coerce')
df['total_returns'] = pd.to_numeric(df['total_returns'],errors='coerce')

# Creating a new column
df['market cap'] = df['price']*df['share_outstanding']

# Printing the tail
df.tail(7)

,permno,company_name,date,total_returns,price,share_outstanding,market cap
2953,10137,ALLEGHENY ENERGY INC,2010-08-31,-0.010965,22.55,169615,3824818.25
2954,10137,ALLEGHENY ENERGY INC,2010-09-30,0.094013,24.52,169615,4158959.80
2955,10137,ALLEGHENY ENERGY INC,2010-10-31,-0.053834,23.20,169615,3935068.00
2956,10137,ALLEGHENY ENERGY INC,2010-11-30,NaN,22.82,169939,3878007.98
2957,10137,ALLEGHENY ENERGY INC,2010-12-31,NaN,NaN,169939,NaN
2958,10137,ALLEGHENY ENERGY INC,2011-01-31,0.063531,25.78,169939,4381027.42
2959,10137,ALLEGHENY ENERGY INC,2011-02-28,-0.009073,NaN,169974,NaN

In [177]:
# Grouping by Company Name and counting number of data points available
df.groupby('permno')['total_returns'].var()
#list(df.groupby('permno')['total_returns'])
#df[['total_returns']]

permno
10001    0.007565
10006    0.007779
10014    0.026291
10028    0.039606
10029    0.019836
10042    0.052273
10048    0.023579
10051    0.024228
10057    0.015555
10064    0.022415
10066    0.081440
10071    0.013895
10085    0.024964
10092    0.026263
10097    0.041925
10102    0.009493
10104    0.002682
10108    0.010004
10116    0.060224
10119    0.008312
10120    0.012519
10123    0.026234
10125    0.106278
10126    0.006824
10137    0.005876
Name: total_returns, dtype: float64

In [179]:
# Aggregating various statistics of returns for each PERMNO
df.groupby('permno')['total_returns'].agg([np.mean,np.median,np.std,np.var]).reset_index()

    permno      mean    median       std       var
0    10001  0.011265  0.005005  0.086980  0.007565
1    10006  0.016444  0.004781  0.088196  0.007779
2    10014  0.066331  0.063492  0.162146  0.026291
3    10028  0.018371  0.000000  0.199012  0.039606
4    10029  0.016912 -0.015385  0.140841  0.019836
5    10042  0.000938 -0.019328  0.228634  0.052273
6    10048  0.013463 -0.006173  0.153554  0.023579
7    10051  0.016105  0.005057  0.155655  0.024228
8    10057  0.016231 -0.003774  0.124718  0.015555
9    10064  0.004924  0.000000  0.149715  0.022415
10   10066 -0.123156 -0.113636  0.285377  0.081440
11   10071  0.036420  0.040795  0.117875  0.013895
12   10085  0.019568  0.004620  0.158000  0.024964
13   10092 -0.014759 -0.030699  0.162058  0.026263
14   10097  0.065653 -0.024390  0.204756  0.041925
15   10102  0.046957  0.005263  0.097431  0.009493
16   10104  0.009577  0.008271  0.051786  0.002682
17   10108  0.017236  0.012736  0.100021  0.010004
18   10116  0.018598 -0.017241  0.245405  0.060224
19   10119  0.005927  0.003708  0.091172  0.008312
20   10120  0.020410  0.010091  0.111890  0.012519
21   10123  0.019944  0.000000  0.161970  0.026234
22   10125 -0.123404 -0.153846  0.326003  0.106278
23   10126  0.008206  0.020000  0.082606  0.006824
24   10137  0.011641  0.013954  0.076652  0.005876

In [ ]:
# Grouping by dates and calculating average returns for each date
df.groupby('date')['total_returns'].mean()#.reset_index()

In [ ]:
# Binning market cap >200,000 USD
df.loc[df['market cap']<=200000,'category'] = 1
df.loc[df['market cap']>200000,'category'] = 2
df.head()

In [ ]:
# Grouping by two columns
df.groupby(['date','category'])['total_returns'].mean().head(15)#reset_index

### Stack/Unstack

In [ ]:
# Simple example of unstacking (from above example)
df.groupby(['date','category'])['total_returns'].mean().head(15)
# Execute the unstack command and show how 1 and 2 are now separate columns

In [ ]:
# creating a new dataframe
df2 = pd.DataFrame(np.linspace(0,10,10).reshape(5,2),columns=['A','B'])
df2

In [ ]:
# Stacking the columns 
df2.stack()

# Take Home Questions

- **Pandas Mul Function** - Use this dataframe created in the code chunk below. We have three columns with random float values. The goal is to multiply columns 1 and 2 with columns 3. Firstly, notice how running the function (df[['col1','col2']]*df['col3']) returns a matrix of NaN values. Now, use the .mul() function by passing df[['col1','col2']].mul(df['col3'],axis=0). Notice how we get the same NaN matrix when we change axis=1 instead.

In [187]:
# Creating a dataframe for problem 1
np.random.seed(123)
df = pd.DataFrame() # Creating a blank data-frame
df['col1'] = np.random.rand(10)
df['col2'] = np.random.rand(10)
df['col3'] = np.random.rand(10)
df

       col1      col2      col3
0  0.696469  0.343178  0.634401
1  0.286139  0.729050  0.849432
2  0.226851  0.438572  0.724455
3  0.551315  0.059678  0.611024
4  0.719469  0.398044  0.722443
5  0.423106  0.737995  0.322959
6  0.980764  0.182492  0.361789
7  0.684830  0.175452  0.228263
8  0.480932  0.531551  0.293714
9  0.392118  0.531828  0.630976

- **Load CSV data** (*stock_data.csv*) - parse dates using the *pd.to_datetime* command, read the stock returns as numeric values using the *pd.to_numeric* command, drop all NaN values using the dropna(), and reset the index. We will be working with this dataframe (unless stated otherwise) for the remainder of the questions below.

- **Aggregating** - For each PERMNO, calculate the following statistics for the total_returns - sum, mean, std dev, and median. *Hint - use .groupby('permno') and then aggregate by the stats. The ".agg()" function might be useful*.

- **Filtering Text** - You can parse the company name column to search for companies that match your key words. A basic filter would be to check for "OIL", "GAS", and "ENERGY" companies. Write a program that returns the number of unique PERMNOs that match the above 3 key-words. *Hint*: Try using df['company_name'].str.contains(). Also, **regex** (regular expression) is a is a powerful library you may want to try out (for those interested in text analysis)!

- **Merging** - Create a new dataframe with the last available date and price for each PERMNO. For example, the only entry for PERMNO 10001 is 31-Jul-2017 (date) and 12.95 (price). Merge this new dataframe onto the original dataframe. Fill the missing/NaN values using pandas fillna function with a method of your choice.

- **Lagged Market Cap** - Create three new columns that contain the 6-month, 1-year, and 5-year lagged market cap. For example: PERMNO 10001 on 30-Jun-2016 will have the market cap as on 31-Dec-2015 (7.45 $\cdot$ 10505 = 78262.25) as its 6-month lag market cap. Perform a similar exercise to generate the 1-year and the 5-year lag market caps.

- **Resampling Frequency** - Convert the monthly dataframe that you loaded above into quarterly data and annual data. *Hint*: First, load and clean the data as per procedure mentioned above. Second, create a new column containing quarters corresponding to the given month (ex: 30-Nov-2010 is a quarter 4). Lastly, create a new dataframe "df_quarter" by aggregating data using the groupby command. For the quarterly dataframe your columns will be {permno, date, quarter, total_returns, market_cap}. Note that you will need to add the monthly returns to generate quarterly returns. Also note that you will need the quarter end market cap for each PERMNO each quarter. For example : In the Quarterly dataframe, PERMNO 10001 as of 31-Mar-2010 will have total returns 0.001055 (-0.018932-0.000656+0.020643) and the market cap 44351.37 (10.17$\cdot$4361). Perform the same procedure for creating data at an annual frequency.

In [203]:
# Question 1
np.random.seed(123)
df = pd.DataFrame() # Creating a blank data-frame
df['col1'] = np.random.rand(10)
df['col2'] = np.random.rand(10)
df['col3'] = np.random.rand(10)
df[['col1','col2']].mul(df['col3'],axis=0) # 10x2 and a 10x1
#df[['col1','col2']]*df['col3']

       col1      col2
0  0.441841  0.217712
1  0.243056  0.619278
2  0.164344  0.317726
3  0.336866  0.036465
4  0.519776  0.287564
5  0.136646  0.238342
6  0.354829  0.066023
7  0.156321  0.040049
8  0.141256  0.156124
9  0.247417  0.335571

In [222]:
# Question 2
df = pd.read_csv("stock_data.csv",sep = ',',parse_dates=['date'])
df['total_returns'] = pd.to_numeric(df['total_returns'],errors='coerce')
df['price'] = pd.to_numeric(df['price'],errors='coerce')
print(df.shape)
df = df.dropna().reset_index(drop=True)
print(df.shape)
df.head()

(2960, 6)
(2913, 6)

   permno company_name       date  total_returns    price  share_outstanding
0   10001   ENERGY INC 2009-12-31       0.162621  10.3000               4361
1   10001   ENERGY INC 2010-01-31      -0.018932  10.0600               4361
2   10001   ENERGY INC 2010-02-28      -0.000656  10.0084               4361
3   10001   ENERGY INC 2010-03-31       0.020643  10.1700               4361
4   10001   ENERGY INC 2010-04-30       0.124385  11.3900               6070

In [206]:
# Question 3
energy = df[df['company_name'].str.contains("ENERGY")]['permno'].nunique()
oil = df[df['company_name'].str.contains("OIL")]['permno'].nunique()
gas = df[df['company_name'].str.contains("GAS")]['permno'].nunique()

print("There are {} energy and {} oil & gas firms".format(energy,oil+gas))

There are 2 energy and 1 oil & gas firms

In [220]:
df_last = df.groupby('permno')['date'].max().reset_index()

# Merging the corresponding price of the last date
df_last = df_last.merge(df[['permno','date','price']],on=['permno','date'],how='left')

df_last.head()

   permno       date   price
0   10001 2017-07-31  12.950
1   10006 1984-05-31  52.625
2   10014 1977-03-31   4.750
3   10028 2019-12-31   1.350
4   10029 1990-07-31   6.125

In [223]:
# Question 4
# First selecting each PERMNO and selecting the last avaialbale date
df_last = df.groupby('permno')['date'].max().reset_index()

# Merging the corresponding price of the last date
df_last = df_last.merge(df[['permno','date','price']],on=['permno','date'],how='left')

# Printing the output of the above dataframe
df_last = df_last.rename(columns={'price':'price_last'}) #renaming price to price_last

# Merging df_last onto our original dataframe
df = df.merge(df_last[['permno','price_last']],on=['permno'],how='left')

df.head()

,permno,company_name,date,total_returns,price,share_outstanding,price_last
0,10001,ENERGY INC,2009-12-31,0.162621,10.3000,4361,12.95
1,10001,ENERGY INC,2010-01-31,-0.018932,10.0600,4361,12.95
2,10001,ENERGY INC,2010-02-28,-0.000656,10.0084,4361,12.95
3,10001,ENERGY INC,2010-03-31,0.020643,10.1700,4361,12.95
4,10001,ENERGY INC,2010-04-30,0.124385,11.3900,6070,12.95

In [ ]:
# First selecting each PERMNO and selecting the last avaialbale date
df_last = df.groupby('permno')['date'].max().reset_index()

# Merging the corresponding price of the last date
df_last = df_last.merge(df[['permno','date','price']],on=['permno','date'],how='left')

df = df.merge(df_last,on=['permno','date'],how='left')

df[df['permno']==10001]

In [231]:
# Question 5
# Loading and cleaning the dataframe
df = pd.read_csv("stock_data.csv",sep = ',',parse_dates=['date'])
df['total_returns'] = pd.to_numeric(df['total_returns'],errors='coerce')
df['price'] = pd.to_numeric(df['price'],errors='coerce')
df = df.dropna().reset_index(drop=True) # Passing multiple functions (big plus of Python!)

# Computing market cap
df['market_cap'] = df['price']*df['share_outstanding']

# Creating 6-month lag column for each date
df['date_lag_6m'] = df['date']- pd.tseries.offsets.MonthEnd(6)

# Creating 1-year and 5-year lag columns for each date
df['date_lag_1y'] = df['date']- pd.tseries.offsets.MonthEnd(12)
df['date_lag_5y'] = df['date']- pd.tseries.offsets.MonthEnd(60)

# Merging market cap for lag 6-months column
df = df.merge(df[['permno',
                  'date',
                  'market_cap']].rename(columns={'market_cap':'market_cap_lag_6m'}),
              left_on=['permno','date_lag_6m'],
              right_on=['permno','date'],
              how='left')

df.head(10)

# Note : You don't want to apply the shift operator since firms could get listed/delisted/listed again
# Similarly you can do this for 1Y and 5Y lags

,permno,company_name,date_x,total_returns,price,share_outstanding,market_cap,date_lag_6m,date_lag_1y,date_lag_5y,date_y,market_cap_lag_6m
0,10001,ENERGY INC,2009-12-31,0.162621,10.3000,4361,44918.3000,2009-06-30,2008-12-31,2004-12-31,NaT,NaN
1,10001,ENERGY INC,2010-01-31,-0.018932,10.0600,4361,43871.6600,2009-07-31,2009-01-31,2005-01-31,NaT,NaN
2,10001,ENERGY INC,2010-02-28,-0.000656,10.0084,4361,43646.6324,2009-08-31,2009-02-28,2005-02-28,NaT,NaN
3,10001,ENERGY INC,2010-03-31,0.020643,10.1700,4361,44351.3700,2009-09-30,2009-03-31,2005-03-31,NaT,NaN
4,10001,ENERGY INC,2010-04-30,0.124385,11.3900,6070,69137.3000,2009-10-31,2009-04-30,2005-04-30,NaT,NaN
5,10001,ENERGY INC,2010-05-31,0.004829,11.4000,6071,69209.4000,2009-11-30,2009-05-31,2005-05-31,NaT,NaN
6,10001,ENERGY INC,2010-06-30,-0.043421,10.8600,6080,66028.8000,2009-12-31,2009-06-30,2005-06-30,2009-12-31,44918.3000
7,10001,GAS NATURAL INC,2010-07-31,0.083333,11.7200,6080,71257.6000,2010-01-31,2009-07-31,2005-07-31,2010-01-31,43871.6600
8,10001,GAS NATURAL INC,2010-08-31,-0.111263,10.3710,6073,62983.0830,2010-02-28,2009-08-31,2005-08-31,2010-02-28,43646.6324
9,10001,GAS NATURAL INC,2010-09-30,0.076560,11.1200,6073,67531.7600,2010-03-31,2009-09-30,2005-09-30,2010-03-31,44351.3700

In [230]:
df[['permno','date','market_cap']].rename(columns={'date':'date_lag_6m','market_cap':'market_cap_lag_6m'})

      permno date_lag_6m  market_cap_lag_6m
0      10001  2009-12-31       4.491830e+04
1      10001  2010-01-31       4.387166e+04
2      10001  2010-02-28       4.364663e+04
3      10001  2010-03-31       4.435137e+04
4      10001  2010-04-30       6.913730e+04
5      10001  2010-05-31       6.920940e+04
6      10001  2010-06-30       6.602880e+04
7      10001  2010-07-31       7.125760e+04
8      10001  2010-08-31       6.298308e+04
9      10001  2010-09-30       6.753176e+04
10     10001  2010-10-31       6.948595e+04
11     10001  2010-11-30       7.865336e+04
12     10001  2010-12-31       8.241368e+04
13     10001  2011-01-31       8.445052e+04
14     10001  2011-02-28       8.601732e+04
15     10001  2011-03-31       9.189282e+04
16     10001  2011-04-30       9.153573e+04
17     10001  2011-05-31       9.373650e+04
18     10001  2011-06-30       9.414405e+04
19     10001  2011-07-31       9.112818e+04
20     10001  2011-08-31       8.950896e+04
21     10001  2011-09-30       8.959048e+04
22     10001  2011-10-31       8.967200e+04
23     10001  2011-11-30       8.887860e+04
24     10001  2011-12-31       9.311868e+04
25     10001  2012-01-31       9.091710e+04
26     10001  2012-02-29       9.100516e+04
27     10001  2012-03-31       9.507564e+04
28     10001  2012-04-30       9.329402e+04
29     10001  2012-05-31       8.506708e+04
...      ...         ...                ...
2883   10137  2008-06-30       8.420033e+06
2884   10137  2008-07-31       8.132700e+06
2885   10137  2008-08-31       7.654469e+06
2886   10137  2008-09-30       6.209019e+06
2887   10137  2008-10-31       5.091159e+06
2888   10137  2008-11-30       5.959154e+06
2889   10137  2008-12-31       5.724168e+06
2890   10137  2009-01-31       5.619355e+06
2891   10137  2009-02-28       3.996437e+06
2892   10137  2009-03-31       3.924465e+06
2893   10137  2009-04-30       4.390252e+06
2894   10137  2009-05-31       4.234975e+06
2895   10137  2009-06-30       4.345084e+06
2896   10137  2009-07-31       4.270549e+06
2897   10137  2009-08-31       4.476046e+06
2898   10137  2009-09-30       4.494689e+06
2899   10137  2009-10-31       3.867602e+06
2900   10137  2009-11-30       3.726995e+06
2901   10137  2009-12-31       3.981339e+06
2902   10137  2010-01-31       3.552345e+06
2903   10137  2010-02-28       3.840760e+06
2904   10137  2010-03-31       3.900110e+06
2905   10137  2010-04-30       3.693235e+06
2906   10137  2010-05-31       3.469586e+06
2907   10137  2010-06-30       3.506894e+06
2908   10137  2010-07-31       3.866401e+06
2909   10137  2010-08-31       3.824818e+06
2910   10137  2010-09-30       4.158960e+06
2911   10137  2010-10-31       3.935068e+06
2912   10137  2011-01-31       4.381027e+06

[2913 rows x 3 columns]

In [241]:
# Question 6
# Loading and cleaning the dataframe
df = pd.read_csv("stock_data.csv",sep = ',',parse_dates=['date'])
df['total_returns'] = pd.to_numeric(df['total_returns'],errors='coerce')
df['price'] = pd.to_numeric(df['price'],errors='coerce')
df = df.dropna().reset_index(drop=True) # Passing multiple functions (big plus of Python!)

# Computing market cap
df['market_cap'] = df['price']*df['share_outstanding']

# Creating quarters column
df['quarter'] = df['date'].dt.quarter

# Creating year column
df['year'] = df['date'].dt.year

# Selecting quarter end month
df = df.merge(df.groupby(['permno',
                          'year',
                          'quarter'])['date'].max().reset_index().rename(columns={'date':'date_quarter_max'}),on=['permno',
                                                                                                                  'year',
                                                                                                                  'quarter'],how='left')

# Creating df_quarter dataframe with averaged monthly returns for each quarter
df_quarter = df.groupby(['permno','year','quarter','date_quarter_max'])['total_returns'].sum().reset_index()

# Merging quarter end market cap values
df_quarter = df_quarter.merge(df[['permno','date','market_cap']],
                              left_on=['permno','date_quarter_max'],
                              right_on=['permno','date'],
                              how='left')

df_quarter.head()

,permno,year,quarter,date_quarter_max,total_returns,date,market_cap
0,10001,2009,4,2009-12-31,0.162621,2009-12-31,44918.30
1,10001,2010,1,2010-03-31,0.001055,2010-03-31,44351.37
2,10001,2010,2,2010-06-30,0.085793,2010-06-30,66028.80
3,10001,2010,3,2010-09-30,0.048630,2010-09-30,67531.76
4,10001,2010,4,2010-12-31,-0.033330,2010-12-31,82413.68